In [ ]:
%reload_ext sql
%matplotlib inline
import configparser
import os

In [ ]:
import os
import configparser

mycfg = configparser.ConfigParser()
mycfg.read("/home/jovyan/CSCI3287/home/mysql.cfg")
print(f"User    : [{mycfg['mysql']['user']}]")
database = mycfg['mysql']['url'].split('@')[1]  # leave off the password
print(f"Database: [[mysql://{mycfg['mysql']['user']}...@{database}]")

db_url = mycfg['mysql']['url'] 
os.environ['DATABASE_URL'] = db_url

In [ ]:
%reload_ext sql
print ("get version...")
%sql SELECT version()

In [76]:
%%sql
DROP TABLE if EXISTS Pay;

 * mysql://grha8384:***@applied-sql.cs.colorado.edu:3306/grha8384
0 rows affected.

[]

In [77]:
%%sql
DROP TABLE if EXISTS Employee;

 * mysql://grha8384:***@applied-sql.cs.colorado.edu:3306/grha8384
0 rows affected.

[]

In [80]:
%%sql
DROP TABLE if EXISTS Store;

 * mysql://grha8384:***@applied-sql.cs.colorado.edu:3306/grha8384
0 rows affected.

[]

In [79]:
%%sql
DROP TABLE if EXISTS Position;

 * mysql://grha8384:***@applied-sql.cs.colorado.edu:3306/grha8384
0 rows affected.

[]

In [71]:
%%sql
CREATE TABLE Employee
     (
     emp_id int(11) NOT NULL,
     fullname VARCHAR(30) NOT NULL,
     phone_num VARCHAR(12),
     start_date Date,
     email_address VARCHAR(50),
     position_id int(11) NOT NULL,
     store_id int(11) NOT NULL,
     weekly_hours decimal(3,1) DEFAULT NULL,
     PRIMARY KEY (emp_id),
     FOREIGN KEY (position_id) REFERENCES Position (position_id) ON DELETE CASCADE ON UPDATE CASCADE,
     FOREIGN KEY (store_id) REFERENCES Store (store_id) ON DELETE CASCADE ON UPDATE CASCADE
     );

 * mysql://grha8384:***@applied-sql.cs.colorado.edu:3306/grha8384
0 rows affected.

[]

In [ ]:
%%sql # Insert employees for store # 1
INSERT INTO `Employee` VALUES (1,'Grant Hargrave','9523939649','2020-11-11','granthargrav@gmail.com',2,1,35.0);
INSERT INTO `Employee` VALUES (2,'Lawrence Byrd','2826068703','2020-03-02','LawrenceByrd@gmail.com',1,1,34.0);
INSERT INTO `Employee` VALUES (3,'Tyrone Deleon','7519900398','2021-01-15','TyroneDeleon@gmail.com',3,1,13.0);
INSERT INTO `Employee` VALUES (4,'Maribel Osborn','5018632139','2020-11-06','MaribelOsborn@gmail.com',3,1,33.0);
INSERT INTO `Employee` VALUES (5,'Natalie Pierce','5464025043','2019-10-10','NataliePierce@gmail.com',3,1,42.0);
INSERT INTO `Employee` VALUES (6,'Dalia Santiago','9394118138','2022-12-02','DaliaSantiago@gmail.com',3,1,21.0);
INSERT INTO `Employee` VALUES (7,'Anahi Marks','7672881161','2020-05-02','AnahiMarks@gmail.com',3,1,19.0);
INSERT INTO `Employee` VALUES (8,'Danika Olsen','9159706547','2021-01-02','DanikaOlsen@gmail.com',3,1,7.0);
INSERT INTO `Employee` VALUES (9,'Coby Chaney','8249391666','2021-07-07','CobyChaney@gmail.com',3,1,19.0);
INSERT INTO `Employee` VALUES (10,'Kyler Rubio','7669510852','2021-12-02','KylerRubio@gmail.com',3,1,6.0);

In [ ]:
%%sql # Insert employees for store # 2
INSERT INTO `Employee` VALUES (11,'Zackary Mueller','3952194679','2020-03-02','ZackaryMueller@gmail.com',1,2,21.0);
INSERT INTO `Employee` VALUES (12,'Antwan Mcdaniel','4694040511','2021-01-15','AntwanMcdaniel@gmail.com',2,2,19.0);
INSERT INTO `Employee` VALUES (13,'Davian Prince','5438001987','2020-11-06','DavianPrince@gmail.com',3,2,7.0);
INSERT INTO `Employee` VALUES (14,'Jayden Baird','2295542612','2019-10-10','JaydenBaird@gmail.com',3,2,19.0);
INSERT INTO `Employee` VALUES (15,'Elliana Moon','8592336949','2022-12-02','EllianaMoon@gmail.com',3,2,6.0);
INSERT INTO `Employee` VALUES (16,'Moshe Parker','7856087481','2020-05-02','MosheParker@gmail.com',3,2,42.0);
INSERT INTO `Employee` VALUES (17,'Leia Jacobs','4059470965','2021-01-02','LeiaJacobs@gmail.com',3,2,33.0);
INSERT INTO `Employee` VALUES (18,'Shirley Mcclain','5415730778','2021-07-07','ShirleyMcclain@gmail.com',3,2,13.0);
INSERT INTO `Employee` VALUES (19,'Katherine Brown','4383554391','2021-12-02','KatherineBrown@gmail.com',3,2,34.0);
INSERT INTO `Employee` VALUES (20,'Rachael Rich','2284384810','2021-12-02','RachaelRich@gmail.com',3,2,35.0);

In [ ]:
%%sql # Insert employees for store # 3
INSERT INTO `Employee` VALUES (21,'Cassie Pratt','7324981220','2020-03-02','CassiePratt@gmail.com',1,3,19.0);
INSERT INTO `Employee` VALUES (22,'Nayeli Riddle','9574321580','2021-01-15','NayeliRiddle@gmail.com',2,3,34.0);
INSERT INTO `Employee` VALUES (23,'Damaris Farrell','2208463556','2020-11-06','DamarisFarrell@gmail.com',3,3,21.0);
INSERT INTO `Employee` VALUES (24,'Sanaa Morales','7868242764','2019-10-10','SanaaMoralesd@gmail.com',3,3,35.0);
INSERT INTO `Employee` VALUES (25,'Brandon Moody','8714687325','2022-12-02','BrandonMoody@gmail.com',3,3,13.0);
INSERT INTO `Employee` VALUES (26,'Savanna Velez','4884216267','2020-05-02','SavannaVelez@gmail.com',3,3,33.0);
INSERT INTO `Employee` VALUES (27,'Janiya Cannon','9827173628','2021-01-02','Janiya Cannon@gmail.com',3,3,42.0);
INSERT INTO `Employee` VALUES (28,'Kailey Joseph','8786821003','2021-07-07','KaileyJoseph@gmail.com',3,3,6.0);
INSERT INTO `Employee` VALUES (29,'Rodney Diaz','2523284612','2021-12-02','RodneyDiaz@gmail.com',3,3,19.0);
INSERT INTO `Employee` VALUES (30,'Dakota Greer','7846639191','2021-12-02','DakotaGreer@gmail.com',3,3,7.0);

In [72]:
%%sql # Table for holding information for calculating salary
CREATE TABLE Pay
    (
        emp_id int(11) NOT NULL, 
        pay_rate decimal(4,2) NOT NULL, 
        days_missed int(20) DEFAULT NULL,
        KEY (emp_id),
        FOREIGN KEY (emp_id) REFERENCES Employee (emp_id) ON DELETE CASCADE ON UPDATE CASCADE
    );

 * mysql://grha8384:***@applied-sql.cs.colorado.edu:3306/grha8384
0 rows affected.

[]

In [ ]:
%%sql # Insert statements for pay table 
INSERT INTO Pay VALUES (1,18.0,2);
INSERT INTO Pay VALUES (2,22.0,0);
INSERT INTO Pay VALUES (3,13.5,0);
INSERT INTO Pay VALUES (4,13.5,0);
INSERT INTO Pay VALUES (5,13.5,0);
INSERT INTO Pay VALUES (6,13.5,0);
INSERT INTO Pay VALUES (7,13.5,0);
INSERT INTO Pay VALUES (8,13.5,0);
INSERT INTO Pay VALUES (9,13.5,0);
INSERT INTO Pay VALUES (10,13.5,0);
INSERT INTO Pay VALUES (11,13.5,0);
INSERT INTO Pay VALUES (12,13.5,0);
INSERT INTO Pay VALUES (13,13.5,0);
INSERT INTO Pay VALUES (14,13.5,0);
INSERT INTO Pay VALUES (15,13.5,0);
INSERT INTO Pay VALUES (16,13.5,0);
INSERT INTO Pay VALUES (17,13.5,0);
INSERT INTO Pay VALUES (18,13.5,0);
INSERT INTO Pay VALUES (19,13.5,0);
INSERT INTO Pay VALUES (20,13.5,0);
INSERT INTO Pay VALUES (21,13.5,0);
INSERT INTO Pay VALUES (22,13.5,0);
INSERT INTO Pay VALUES (23,13.5,0);
INSERT INTO Pay VALUES (24,13.5,0);
INSERT INTO Pay VALUES (25,13.5,0);
INSERT INTO Pay VALUES (26,13.5,0);
INSERT INTO Pay VALUES (27,13.5,0);
INSERT INTO Pay VALUES (28,13.5,0);
INSERT INTO Pay VALUES (29,13.5,0);
INSERT INTO Pay VALUES (30,13.5,0);

In [ ]:
%%sql
DELETE 
FROM Position

In [69]:
%%sql # Initialize store table 
CREATE TABLE Store
    (
        store_id int(11) NOT NULL,
        address VARCHAR(50) NOT NULL,
        city VARCHAR(50) NOT NULL,
        state_code VARCHAR(2) NOT NULL,
        PRIMARY KEY (store_id)
    );

 * mysql://grha8384:***@applied-sql.cs.colorado.edu:3306/grha8384
(MySQLdb._exceptions.OperationalError) (1050, "Table 'Store' already exists")
[SQL: # Initialize store table
CREATE TABLE Store
    (
        store_id int(11) NOT NULL,
        address VARCHAR(50) NOT NULL,
        city VARCHAR(50) NOT NULL,
        state_code VARCHAR(2) NOT NULL,
        PRIMARY KEY (store_id)
    );]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [ ]:
%%sql # Inserts values into store table 
INSERT INTO Store VALUES (1,'1326 Pearl St','Boulder','CO');
INSERT INTO Store VALUES (2,'19885 Chartwell Hill','Minnetonka','MN');
INSERT INTO Store VALUES (3,'1555 Broadway St','Madison','WI');

In [68]:
%%sql # Initialize position table 
CREATE TABLE Position
    (
        position_id int(11) NOT NULL,
        position_name VARCHAR(30) NOT NULL,
        store_id int(11) NOT NULL,
        PRIMARY KEY (position_id, store_id),
        FOREIGN KEY (store_id) REFERENCES Store (store_id) ON DELETE CASCADE ON UPDATE CASCADE
    );

 * mysql://grha8384:***@applied-sql.cs.colorado.edu:3306/grha8384
0 rows affected.

[]

In [ ]:
%%sql # Inserts values into position table 
INSERT INTO Position VALUES (1,'Owner');
INSERT INTO Position VALUES (2,'Manager');
INSERT INTO Position VALUES (3,'Sales Associate');

In [ ]:
%%sql
DROP TABLE Position